psychoStark/ESP32-SwitchBot/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PM_ENABLE=y

# Enable Octal PSRAM for Tailscale buffers
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Enable Arduino Component Autostart requirements
CONFIG_AUTOSTART_ARDUINO=y
CONFIG_FREERTOS_HZ=1000
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y


# Clamp TCP MSS so WireGuard encapsulated frames do not fragment or drop
CONFIG_LWIP_TCP_MSS=1240

# Larger TCP buffers so full HTTP responses flush in one burst without Nagle stalls.
# Over a 100-1000ms RTT (Tailscale DERP) every ACK-wait round-trip is painful;
# a bigger window lets the entire response go out before waiting for ACKs.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=16384
CONFIG_LWIP_TCP_WND_DEFAULT=16384

# Disable Nagle's algorithm globally. lwIP holds small writes until the previous
# segment is ACK'd by default (Nagle). Over DERP relay (900ms RTT) that means
# every HTTP header fragment is delayed by a full RTT before flushing.
CONFIG_LWIP_TCP_NODELAY=y

# Ensure WireGuard interface can route packets between lwIP and virtual TUN
CONFIG_LWIP_IP_FORWARD=y

# Larger TCPIP task stack — WireGuard + WebServer + DERP TLS all share the
# lwIP thread; the default 3072 bytes is tight when all three are active.
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=4096
